// Задача 10: Показать вторую цифру трёхзначного числа.
Console.WriteLine("Введите трехзначное число: ");
string num1 = Console.ReadLine();
Console.WriteLine("Вторая цифра " + num1[1]);