// Задача 12: Удалить вторую цифру трёхзначного числа.
Console.WriteLine("Введите трехзначное число: ");
string num1 = Console.ReadLine();
Console.WriteLine("Число без второй цифры " + num1[0] + num1[2]);