// Задача 2: Даны два числа. Показать большее и меньшее число
int num1 = 4, num2 = 9;
if (num2 == num1)
Console.WriteLine("Числа равны!");
else if(num2 > num1)
Console.WriteLine("Большее число: " + num2 + "   Меньшее число:" + num1);
else
Console.WriteLine("Большее число: " + num1 + "   Меньшее число:" + num2);
